aaron-bond.better-comments
asciidoctor.asciidoctor-vscode
bdavs.expect
bungcip.better-toml
coolbear.systemd-unit-file
cschlosser.doxdocgen
cstrachan.vcard
DavidWang.ini-for-vscode
enkia.tokyo-night
ericadamski.carbon-now-sh
evgeniypeshkov.syntax-highlighter
ferhatgec.flascript
GitHub.copilot
James-Yu.latex-workshop
jeff-hykin.better-cpp-syntax
kiteco.kite
lextudio.restructuredtext
lizheng.auto-insert-semicolon
luveti.kconfig
luyizhi.vscode-jsonp
mads-hartmann.bash-ide-vscode
miguelsolorio.fluent-icons
ms-azuretools.vscode-docker
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.powershell
ms-vscode.remote-repositories
ms-vsliveshare.vsliveshare
ms-vsliveshare.vsliveshare-audio
ms-vsliveshare.vsliveshare-pack
myh.preview-vscode
nickdemayo.vscode-json-editor
nickfode.latex-formatter
njpwerner.autodocstring
njqdev.vscode-python-typehint
peaceshi.syntax-highlight
PKief.material-icon-theme
rashwell.tcl
RDebugger.r-debugger
redhat.java
redhat.vscode-yaml
REditorSupport.r
timonwong.shellcheck
trond-snekvik.simple-rst
twxs.cmake
usernamehw.highlight-logical-line
VisualStudioExptTeam.intellicode-api-usage-examples
VisualStudioExptTeam.vscodeintellicode
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
WakaTime.vscode-wakatime
wengerk.highlight-bad-chars
xaver.clang-format
