aaron-bond.better-comments
asciidoctor.asciidoctor-vscode
bdavs.expect
bungcip.better-toml
coolbear.systemd-unit-file
cstrachan.vcard
DavidAnson.vscode-markdownlint
DavidWang.ini-for-vscode
donjayamanne.githistory
dsznajder.es7-react-js-snippets
enkia.tokyo-night
ericadamski.carbon-now-sh
evgeniypeshkov.syntax-highlighter
ferhatgec.flascript
frinkr.pdf
GitHub.copilot
GitHub.remotehub
James-Yu.latex-workshop
jeff-hykin.better-cpp-syntax
lextudio.restructuredtext
llvm-vs-code-extensions.vscode-clangd
luveti.kconfig
luyizhi.vscode-jsonp
mads-hartmann.bash-ide-vscode
miguelsolorio.fluent-icons
ms-azuretools.vscode-docker
ms-python.black-formatter
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.azure-repos
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.makefile-tools
ms-vscode.powershell
ms-vscode.remote-explorer
ms-vscode.remote-repositories
ms-vsliveshare.vsliveshare
myh.preview-vscode
nickdemayo.vscode-json-editor
nickfode.latex-formatter
njpwerner.autodocstring
njqdev.vscode-python-typehint
peaceshi.syntax-highlight
PKief.material-icon-theme
rashwell.tcl
RDebugger.r-debugger
redhat.java
redhat.vscode-yaml
REditorSupport.r
sidneys1.gitconfig
SimonSiefke.svg-preview
tdennis4496.cmantic
tecosaur.latex-utilities
timonwong.shellcheck
tomoki1207.pdf
trond-snekvik.simple-rst
twxs.cmake
usernamehw.errorlens
usernamehw.highlight-logical-line
vadimcn.vscode-lldb
VisualStudioExptTeam.intellicode-api-usage-examples
VisualStudioExptTeam.vscodeintellicode
VisualStudioExptTeam.vscodeintellicode-completions
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
WakaTime.vscode-wakatime
wengerk.highlight-bad-chars
xabikos.JavaScriptSnippets
xaver.clang-format
