aaron-bond.better-comments
asciidoctor.asciidoctor-vscode
bdavs.expect
coolbear.systemd-unit-file
cstrachan.vcard
davidanson.vscode-markdownlint
davidwang.ini-for-vscode
donjayamanne.githistory
dsznajder.es7-react-js-snippets
eamodio.gitlens
enkia.tokyo-night
evgeniypeshkov.syntax-highlighter
frinkr.pdf
github.copilot
github.copilot-chat
github.remotehub
james-yu.latex-workshop
jeff-hykin.better-cpp-syntax
llvm-vs-code-extensions.vscode-clangd
luveti.kconfig
luyizhi.vscode-jsonp
mads-hartmann.bash-ide-vscode
mechatroner.rainbow-csv
miguelsolorio.fluent-icons
ms-azuretools.vscode-docker
ms-python.black-formatter
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.azure-repos
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.hexeditor
ms-vscode.makefile-tools
ms-vscode.remote-explorer
ms-vscode.remote-repositories
ms-vscode.remote-server
ms-vsliveshare.vsliveshare
myh.preview-vscode
nickdemayo.vscode-json-editor
nickfode.latex-formatter
njpwerner.autodocstring
njqdev.vscode-python-typehint
peaceshi.syntax-highlight
pkief.material-icon-theme
rdebugger.r-debugger
redhat.vscode-yaml
reditorsupport.r
sidneys1.gitconfig
simonsiefke.svg-preview
tamasfe.even-better-toml
tdennis4496.cmantic
tecosaur.latex-utilities
timonwong.shellcheck
tomoki1207.pdf
twxs.cmake
usernamehw.errorlens
vadimcn.vscode-lldb
visualstudioexptteam.vscodeintellicode-completions
wakatime.vscode-wakatime
wengerk.highlight-bad-chars
xabikos.javascriptsnippets
xaver.clang-format
xenny.markdown-table
yzhang.markdown-all-in-one
