tap "browsh-org/browsh"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "romkatv/powerlevel10k"
brew "automake"
brew "libyaml"
brew "openssl@3"
brew "readline"
brew "python@3.12"
brew "aws-shell"
brew "bat"
brew "bison"
brew "bitwarden-cli"
brew "black", link: false
brew "chruby"
brew "clang-format"
brew "codespell"
brew "coreutils"
brew "cowsay"
brew "dash"
brew "diffutils"
brew "flake8", link: false
brew "fortune"
brew "fribidi"
brew "gcc"
brew "gdbm"
brew "gh"
brew "harfbuzz"
brew "git"
brew "gnupg"
brew "libomp"
brew "imagemagick"
brew "imessage-exporter"
brew "pandoc"
brew "latexindent"
brew "libffi"
brew "librsvg"
brew "lolcat"
brew "m-cli"
brew "media-info"
brew "micro"
brew "nbdime", link: false
brew "neofetch"
brew "notify"
brew "openjdk"
brew "openssl@1.1"
brew "pinentry-mac"
brew "pipx"
brew "pkg-config"
brew "poetry"
brew "powerlevel10k"
brew "pre-commit", link: false
brew "python-setuptools"
brew "python@3.8"
brew "r"
brew "rbenv"
brew "ruby-install"
brew "sevenzip"
brew "shellcheck"
brew "sl"
brew "sshpass"
brew "starship"
brew "thefuck"
brew "transmission-cli"
brew "tree"
brew "w3m"
brew "wget"
brew "xclip"
brew "yamlfmt"
brew "youtube-dl"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "browsh-org/browsh/browsh"
cask "alfred"
cask "anaconda"
cask "anki"
cask "bitwarden"
cask "chromedriver"
cask "dash"
cask "discord"
cask "firefox"
cask "font-3270-nerd-font"
cask "font-agave-nerd-font"
cask "font-anonymice-nerd-font"
cask "font-arimo-nerd-font"
cask "font-aurulent-sans-mono-nerd-font"
cask "font-bigblue-terminal-nerd-font"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-blex-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-code-new-roman-nerd-font"
cask "font-comic-shanns-mono-nerd-font"
cask "font-cousine-nerd-font"
cask "font-daddy-time-mono-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-gohufont-nerd-font"
cask "font-hack-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-heavy-data-nerd-font"
cask "font-hurmit-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-inconsolata-go-nerd-font"
cask "font-inconsolata-lgc-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-iosevka-term-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-lekton-nerd-font"
cask "font-liberation-nerd-font"
cask "font-lilex-nerd-font"
cask "font-m+-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monocraft-nerd-font"
cask "font-monofur-nerd-font"
cask "font-monoid-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-noto-nerd-font"
cask "font-open-dyslexic-nerd-font"
cask "font-overpass-nerd-font"
cask "font-profont-nerd-font"
cask "font-proggy-clean-tt-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-shure-tech-mono-nerd-font"
cask "font-space-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-terminess-ttf-nerd-font"
cask "font-tinos-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-ubuntu-nerd-font"
cask "font-victor-mono-nerd-font"
cask "google-chrome"
cask "keepingyouawake"
cask "kitty"
cask "latexit"
cask "macfuse"
cask "mactex"
cask "open-in-code"
cask "openinterminal"
cask "qbittorrent"
cask "rectangle"
cask "slack"
cask "spotify"
cask "texshop"
cask "visual-studio-code"
cask "vlc"
cask "zoom"
cask "zotero"
vscode "aaron-bond.better-comments"
vscode "analytic-signal.preview-pdf"
vscode "asciidoctor.asciidoctor-vscode"
vscode "bdavs.expect"
vscode "coolbear.systemd-unit-file"
vscode "cstrachan.vcard"
vscode "davidanson.vscode-markdownlint"
vscode "davidwang.ini-for-vscode"
vscode "donjayamanne.githistory"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "evgeniypeshkov.syntax-highlighter"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "james-yu.latex-workshop"
vscode "jeff-hykin.better-cpp-syntax"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "luveti.kconfig"
vscode "luyizhi.vscode-jsonp"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mechatroner.rainbow-csv"
vscode "miguelsolorio.fluent-icons"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "myh.preview-vscode"
vscode "nickdemayo.vscode-json-editor"
vscode "nickfode.latex-formatter"
vscode "njpwerner.autodocstring"
vscode "njqdev.vscode-python-typehint"
vscode "peaceshi.syntax-highlight"
vscode "pkief.material-icon-theme"
vscode "rdebugger.r-debugger"
vscode "redhat.vscode-yaml"
vscode "reditorsupport.r"
vscode "sidneys1.gitconfig"
vscode "simonsiefke.svg-preview"
vscode "tamasfe.even-better-toml"
vscode "tdennis4496.cmantic"
vscode "tecosaur.latex-utilities"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.vscodeintellicode-completions"
vscode "wakatime.vscode-wakatime"
vscode "wengerk.highlight-bad-chars"
vscode "xabikos.javascriptsnippets"
vscode "xaver.clang-format"
vscode "xenny.markdown-table"
vscode "yzhang.markdown-all-in-one"
